app/controllers/decks_controller.rb

SELECT  "decks".* FROM "decks"  WHERE "decks"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @deck = Deck.find(params[:id])

INSERT INTO "decks" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-09-04 19:37:20.798433"], ["name", "swedish"], ["updated_at", "2014-09-04 19:37:20.798433"]]
---
  def create
    @deck = Deck.new
    @deck.name = params[:deck][:name]

    @deck.save

SELECT  "decks".* FROM "decks"  WHERE "decks"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @deck = Deck.find(params[:id])

SELECT  "decks".* FROM "decks"  WHERE "decks"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "decks" SET "name" = $1, "updated_at" = $2 WHERE "decks"."id" = 6  [["name", "Dzonka"], ["updated_at", "2014-09-04 20:00:49.635288"]]
---
  def update
    @deck = Deck.find(params[:id])
    @deck.name = params[:deck][:name]
    @deck.save

SELECT  "decks".* FROM "decks"  WHERE "decks"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "decks" WHERE "decks"."id" = $1  [["id", 7]]
---
  def destroy
    @deck = Deck.find(params[:id])
    @deck.destroy